
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)  
	ДатаНачала = Отчет.Период.ДатаНачала;
	ДатаОкончания = Отчет.Период.ДатаОкончания;  
	
	СформироватьОтчет(ДатаНачала, ДатаОкончания);
	
КонецПроцедуры  

&НаСервере
Процедура СформироватьОтчет(ДатаНачала, ДатаОкончания);
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
	ДокументРезультат = Тип("ТабличныйДокумент");
	ДанныеРасшифровки = Неопределено;  
	СтандартнаяОбработка = Истина;
		
	ОтчетОбъект.ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ДатаНачала, ДатаОкончания);
		
КонецПроцедуры	

