Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ДатаНачала, ДатаОкончания) Экспорт    
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если ДатаНачала = Неопределено и ДатаОкончания = Неопределено Тогда    
		
		Если Не ЗначениеПараметра = Неопределено Тогда  
			ЗначениеПараметра.Использование = Истина; 
			//ЗначениеПараметра.Значение.ДатаНачала = Дата("01.01.0001 0:00:00");  
			//ЗначениеПараметра.Значение.ДатаОкончания = КонецГода(ТекущаяДата());
		КонецЕсли;
		
	Иначе
		ЗначениеПараметра.Использование = Истина; 
		ЗначениеПараметра.Значение.ДатаНачала = ДатаНачала;
		ЗначениеПараметра.Значение.ДатаОкончания = ДатаОкончания;
		
	КонецЕсли; 
	
КонецПроцедуры   


